[Rainmeter]
Update=250
Author=Konstantin
; версия кодируется как major*1000000 + minor*1000 + patch: 4005000 = 4.5.0
AppVersion=4005000
BackgroundMode=2
SolidColor=0,0,0,1
DynamicWindowSize=1
AccurateText=1
MouseScrollUpAction=[!SetVariable Scale "(#Scale#+0.1)"][!WriteKeyValue Variables Scale "(#Scale#+0.1)"][!Refresh]
MouseScrollDownAction=[!SetVariable Scale "(#Scale#-0.1 < 0.5 ? 0.5 : #Scale#-0.1)"][!WriteKeyValue Variables Scale "(#Scale#-0.1 < 0.5 ? 0.5 : #Scale#-0.1)"][!Refresh]

[Metadata]
Name=SMTC Player
Author=Konstantin
Information=Плеер поверх Windows SMTC. Показывает и рулит любым приложением, которое репортит в системный медиа-оверлей: Яндекс Музыка, Spotify, браузеры. Данные пушит фоновый smtc_bridge.exe (автозагрузка). Колесо мыши — масштаб.
Version=1.1

[Variables]
@include=#@#Variables.inc
Scale=1.4

; Дефолты на случай, если мост ещё не отозвался. Дальше значения приходят
; от smtc_bridge.exe бэнгами !SetVariable через WM_COPYDATA.
Title=—
Artist=
Album=
State=0
Header=NOTHING PLAYING
StateIcon=Play.png
Position=0:00
Duration=0:00
Progress=0
AppId=
Cover=
CoverHidden=1
CoverShift=72

;-------------------------------------------------------------
; Меры
;-------------------------------------------------------------

; счётчик, чтобы два одинаковых нажатия подряд не слиплись в одну команду
[MeasureTick]
Measure=Calc
Formula=Counter

; Разовый пуск моста при загрузке скина. Мост собран как winexe — окна не
; создаёт, вторая копия отваливается сама по мьютексу.
[MeasureBoot]
Measure=Calc
Formula=Counter
IfCondition=(MeasureBoot > 0)
IfTrueAction=["#@#Bridge\smtc_bridge.exe" "-CmdFile" "#CURRENTPATH#cmd.ini" "-Config" "#CURRENTCONFIG#" "-PreferApp" "#PreferApp#"][!DisableMeasure MeasureBoot]
DynamicVariables=1
;-------------------------------------------------------------
; Обложка
;-------------------------------------------------------------

; Мост чередует cover0.png / cover1.png — иначе Rainmeter отдавал бы
; закэшированную картинку прошлого трека.
[MeterCover]
Meter=Image
ImageName=#Cover#
MaskImageName=#@#CoverMask.png
X=(68*#Scale#)
Y=0
W=(64*#Scale#)
H=(64*#Scale#)
Hidden=#CoverHidden#
AntiAlias=1
DynamicVariables=1
ToolTipText=#Title##CRLF##Artist#

;-------------------------------------------------------------
; Текст
;-------------------------------------------------------------

[MeterHeader]
Meter=String
X=(100*#Scale#)
Y=((72-#CoverShift#)*#Scale#)
W=(190*#Scale#)
H=(8*#Scale#)
StringAlign=Center
StringCase=Upper
ClipString=1
FontFace=Aquatico
FontSize=(4*#Scale#)
FontColor=#TextColor#,#DimAlpha#
InlineSetting=CharacterSpacing | (2*#Scale#) | (2*#Scale#)
AntiAlias=1
DynamicVariables=1
Text=#Header#
ToolTipText=Источник: #AppId#

[MeterTitle]
Meter=String
X=(100*#Scale#)
Y=((85-#CoverShift#)*#Scale#)
W=(190*#Scale#)
H=(14*#Scale#)
StringAlign=Center
ClipString=1
FontFace=Quicksand
FontSize=(9*#Scale#)
FontColor=#TextColor#
AntiAlias=1
DynamicVariables=1
Text=#Title#
ToolTipText=#Title##CRLF##Artist#

[MeterArtist]
Meter=String
X=(100*#Scale#)
Y=((102-#CoverShift#)*#Scale#)
W=(190*#Scale#)
H=(9*#Scale#)
StringAlign=Center
StringCase=Upper
ClipString=1
FontFace=Aquatico
FontSize=(4.5*#Scale#)
FontColor=#TextColor#,170
InlineSetting=CharacterSpacing | (1*#Scale#) | (1*#Scale#)
AntiAlias=1
DynamicVariables=1
Text=#Artist#

;-------------------------------------------------------------
; Прогресс
;-------------------------------------------------------------

[MeterBar]
Meter=Shape
X=(25*#Scale#)
Y=((118-#CoverShift#)*#Scale#)
Shape=Rectangle 0,0,(150*#Scale#),(1*#Scale#),(0.5*#Scale#) | Fill Color #TextColor#,35 | StrokeWidth 0
Shape2=Rectangle 0,0,(#Progress#*1.5*#Scale#),(1*#Scale#),(0.5*#Scale#) | Fill Color #TextColor# | StrokeWidth 0
Shape3=Ellipse (#Progress#*1.5*#Scale#),(0.5*#Scale#),(1.6*#Scale#) | Fill Color #TextColor# | StrokeWidth 0
Shape4=Ellipse (#Progress#*1.5*#Scale#),(0.5*#Scale#),(4*#Scale#) | Fill Color #TextColor#,45 | StrokeWidth 0
DynamicVariables=1

; прозрачная зона клика с честными габаритами — перемотка
[MeterBarHit]
Meter=Image
SolidColor=0,0,0,1
X=(25*#Scale#)
Y=((113.5-#CoverShift#)*#Scale#)
W=(150*#Scale#)
H=(10*#Scale#)
DynamicVariables=1
LeftMouseUpAction=[!WriteKeyValue Command Action "seek:$MouseX:%$|[MeasureTick]" "#CURRENTPATH#cmd.ini"]
ToolTipText=Перемотка

[MeterPosition]
Meter=String
X=(25*#Scale#)
Y=((123-#CoverShift#)*#Scale#)
StringAlign=Left
FontFace=Quicksand
FontSize=(4*#Scale#)
FontColor=#TextColor#,150
AntiAlias=1
DynamicVariables=1
Text=#Position#

[MeterDuration]
Meter=String
X=(175*#Scale#)
Y=((123-#CoverShift#)*#Scale#)
StringAlign=Right
FontFace=Quicksand
FontSize=(4*#Scale#)
FontColor=#TextColor#,150
AntiAlias=1
DynamicVariables=1
Text=#Duration#

;-------------------------------------------------------------
; Управление
;-------------------------------------------------------------

[MeterPrevious]
Meter=Image
ImageName=#@#Previous.png
X=(73*#Scale#)
Y=((138-#CoverShift#)*#Scale#)
W=(12*#Scale#)
H=(12*#Scale#)
PreserveAspectRatio=1
ImageTint=#ButtonColor#
SolidColor=0,0,0,1
AntiAlias=1
DynamicVariables=1
LeftMouseUpAction=[!WriteKeyValue Command Action "prev|[MeasureTick]" "#CURRENTPATH#cmd.ini"]
MouseOverAction=[!SetOption MeterPrevious ImageTint "#ButtonHover#"][!UpdateMeter MeterPrevious][!Redraw]
MouseLeaveAction=[!SetOption MeterPrevious ImageTint "#ButtonColor#"][!UpdateMeter MeterPrevious][!Redraw]

[MeterPlayPause]
Meter=Image
ImageName=#@##StateIcon#
X=(20*#Scale#)r
Y=0r
W=(12*#Scale#)
H=(12*#Scale#)
PreserveAspectRatio=1
ImageTint=#ButtonColor#
SolidColor=0,0,0,1
AntiAlias=1
DynamicVariables=1
LeftMouseUpAction=[!WriteKeyValue Command Action "playpause|[MeasureTick]" "#CURRENTPATH#cmd.ini"]
MouseOverAction=[!SetOption MeterPlayPause ImageTint "#ButtonHover#"][!UpdateMeter MeterPlayPause][!Redraw]
MouseLeaveAction=[!SetOption MeterPlayPause ImageTint "#ButtonColor#"][!UpdateMeter MeterPlayPause][!Redraw]

[MeterNext]
Meter=Image
ImageName=#@#Next.png
X=(20*#Scale#)r
Y=0r
W=(12*#Scale#)
H=(12*#Scale#)
PreserveAspectRatio=1
ImageTint=#ButtonColor#
SolidColor=0,0,0,1
AntiAlias=1
DynamicVariables=1
LeftMouseUpAction=[!WriteKeyValue Command Action "next|[MeasureTick]" "#CURRENTPATH#cmd.ini"]
MouseOverAction=[!SetOption MeterNext ImageTint "#ButtonHover#"][!UpdateMeter MeterNext][!Redraw]
MouseLeaveAction=[!SetOption MeterNext ImageTint "#ButtonColor#"][!UpdateMeter MeterNext][!Redraw]

; нижний отступ, чтобы DynamicWindowSize не резал кнопки
[MeterPad]
Meter=Image
SolidColor=0,0,0,1
X=0
Y=((152-#CoverShift#)*#Scale#)
W=(200*#Scale#)
H=(2*#Scale#)
DynamicVariables=1
